Certification/src/Documents/УстановкаОграниченийЗаписиНаЛК/УстановкаОграниченийЗаписиНаЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаОграниченийЗаписиНаЛК</name>
  <registerRecords>InformationRegister.ОграниченияЗаписиНаЛК</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ограничения</name>
    <attributes>
      <name>ВидУслуги</name>
      <type>
        <types>CatalogRef.ВидыУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипКлиентаЛК</name>
      <type>
        <types>CatalogRef.ТипыКлиентовЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>МаксимумКонсультацийВНеделю</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимумКонсультацийВДень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйИнтервалВДнях</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонсультацииНедоступны</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Certification/src/Documents/УстановкаОграниченийЗаписиНаЛК/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ДополнительныеСвойства.Свойство("Отказ") И ДополнительныеСвойства.Отказ = Истина Тогда
		Отказ = ДополнительныеСвойства.Отказ;
		ВозВрат;
	КонецЕсли;

	Движения.ОграниченияЗаписиНаЛК.Очистить();
	Движения.ОграниченияЗаписиНаЛК.Записать();
	//ДвиженияОграниченияЗаписиНаЛК = ПолучитьДвиженияОграниченияЗаписиНаЛК(РежимПроведения);
	//Если ДвиженияОграниченияЗаписиНаЛК = Неопределено Тогда
	//	Отказ = Истина;
	//	ВозВрат;
	//КонецЕсли;
	//Движения.ОграниченияЗаписиНаЛК.Загрузить(ДвиженияОграниченияЗаписиНаЛК);
	Движения.ОграниченияЗаписиНаЛК.Записывать = Истина;
	// регистр ОграниченияЗаписиНаЛК
	Для Каждого ТекСтрокаОграничения Из Ограничения Цикл
		Движение = Движения.ОграниченияЗаписиНаЛК.Добавить();
		Движение.Период							= Дата;
		Движение.ВидУслуги						= ТекСтрокаОграничения.ВидУслуги;
		Движение.ТипКлиентаЛК					= ТекСтрокаОграничения.ТипКлиентаЛК;
		Движение.МаксимумКонсультацийВНеделю	= ТекСтрокаОграничения.МаксимумКонсультацийВНеделю;
		Движение.МаксимумКонсультацийВДень		= ТекСтрокаОграничения.МаксимумКонсультацийВДень;
		Движение.МинимальныйИнтервалВДнях		= ТекСтрокаОграничения.МинимальныйИнтервалВДнях;
		Движение.КонсультацииНедоступны			= ТекСтрокаОграничения.КонсультацииНедоступны;
	КонецЦикла;
	
	
	Движения.Записать();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	БоР_ОбщийМодуль.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если Не ЗначениеЗаполнено(Автор) Тогда
		Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДата();
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьДвиженияОграниченияЗаписиНаЛК(РежимПроведения)
	
	//// регистр ОграниченияЗаписиНаЛК
	//Движения.ОграниченияЗаписиНаЛК.Записывать = Истина;
	//Движения.ОграниченияЗаписиНаЛК.Очистить();
	//Для Каждого ТекСтрокаОграничения Из Ограничения Цикл
	//	Движение = Движения.ОграниченияЗаписиНаЛК.Добавить();
	//	Движение.Период							= Дата;
	//	Движение.ВидУслуги				= ТекСтрокаОграничения.ВидУслуги;
	//	Движение.ТипКлиентаЛК					= ТекСтрокаОграничения.ТипКлиентаЛК;
	//	Движение.МаксимумКонсультацийВНеделю	= ТекСтрокаОграничения.МаксимумКонсультацийВНеделю;
	//	Движение.МаксимумКонсультацийВДень		= ТекСтрокаОграничения.МаксимумКонсультацийВДень;
	//	Движение.МинимальныйИнтервалВДнях		= ТекСтрокаОграничения.МинимальныйИнтервалВДнях;
	//	Движение.КонсультацииНедоступны			= ТекСтрокаОграничения.КонсультацииНедоступны;
	//КонецЦикла;

КонецФункции
